Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input (InputLayer)              [(None, 145, 4)]     0
__________________________________________________________________________________________________
convolution_layer (ConvolutionL (None, 134, 512)     25088       input[0][0]
__________________________________________________________________________________________________
tf.math.sigmoid (TFOpLambda)    (None, 134, 512)     0           convolution_layer[0][0]
__________________________________________________________________________________________________
global_max_pooling1d (GlobalMax (None, 512)          0           tf.math.sigmoid[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1)            65          dense[0][0]
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 1)            65          dense_1[0][0]
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1)            65          dense_2[0][0]
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 1)            65          dense_3[0][0]
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1)            65          dense_4[0][0]
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 1)            65          dense_5[0][0]
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 1)            65          dense_6[0][0]
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 1)            65          dense_7[0][0]
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1)            65          dense_8[0][0]
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1)            65          dense_9[0][0]
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 1)            65          dense_10[0][0]
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 1)            65          dense_11[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12)           0           dense_12[0][0]
                                                                 dense_13[0][0]
                                                                 dense_14[0][0]
                                                                 dense_15[0][0]
                                                                 dense_16[0][0]
                                                                 dense_17[0][0]
                                                                 dense_18[0][0]
                                                                 dense_19[0][0]
                                                                 dense_20[0][0]
                                                                 dense_21[0][0]
                                                                 dense_22[0][0]
                                                                 dense_23[0][0]
==================================================================================================
Total params: 419,852
Trainable params: 419,852
Non-trainable params: 0
__________________________________________________________________________________________________
2021-04-26 17:20:47.866943: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:116] None of the MLIR optimization passes are enabled (registered 2)
Epoch 1/2
self.run value is 2
WARNING:tensorflow:Gradients do not exist for variables ['convolution_layer/bias:0'] when minimizing the loss.
self.run value is 3
WARNING:tensorflow:Gradients do not exist for variables ['convolution_layer/bias:0'] when minimizing the loss.
1786/1786 [==============================] - ETA: 0s - loss: 1.0116 - coeff_determination: -1.1605e-04 - spearman_fn: 0.1457self.run value is 4
1786/1786 [==============================] - 455s 254ms/step - loss: 1.0116 - coeff_determination: -1.0994e-04 - spearman_fn: 0.1457 - val_loss: 0.9851 - val_coeff_determination: -0.0135 - val_spearman_fn: 0.2754
Epoch 2/2
1786/1786 [==============================] - 440s 246ms/step - loss: 0.9698 - coeff_determination: 0.0356 - spearman_fn: 0.3280 - val_loss: 0.9720 - val_coeff_determination: 3.5881e-04 - val_spearman_fn: 0.3307
self.run value is 5
Test spearman averages are: [0.26956096 0.09770917 0.1586256  0.16808094]
Test Mean spearman is 0.15978478471267862
Validation spearman averages are: [0.28337498 0.10555585 0.16583455 0.14212374]
Validation Mean spearman is 0.1594092256204943
