Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input (InputLayer)              [(None, 145, 4)]     0
__________________________________________________________________________________________________
convolution_layer (ConvolutionL (None, 134, 640)     31360       input[0][0]
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 134, 640)     0           convolution_layer[0][0]
__________________________________________________________________________________________________
global_max_pooling1d (GlobalMax (None, 640)          0           re_lu[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 64)           41024       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1)            65          dense[0][0]
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 1)            65          dense_1[0][0]
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1)            65          dense_2[0][0]
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 1)            65          dense_3[0][0]
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1)            65          dense_4[0][0]
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 1)            65          dense_5[0][0]
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 1)            65          dense_6[0][0]
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 1)            65          dense_7[0][0]
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1)            65          dense_8[0][0]
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1)            65          dense_9[0][0]
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 1)            65          dense_10[0][0]
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 1)            65          dense_11[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12)           0           dense_12[0][0]
                                                                 dense_13[0][0]
                                                                 dense_14[0][0]
                                                                 dense_15[0][0]
                                                                 dense_16[0][0]
                                                                 dense_17[0][0]
                                                                 dense_18[0][0]
                                                                 dense_19[0][0]
                                                                 dense_20[0][0]
                                                                 dense_21[0][0]
                                                                 dense_22[0][0]
                                                                 dense_23[0][0]
==================================================================================================
Total params: 524,428
Trainable params: 524,428
Non-trainable params: 0
__________________________________________________________________________________________________
2021-04-26 14:10:13.986439: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:116] None of the MLIR optimization passes are enabled (registered 2)
Epoch 1/2
self.run value is 2
WARNING:tensorflow:Gradients do not exist for variables ['convolution_layer/bias:0'] when minimizing the loss.
self.run value is 3
WARNING:tensorflow:Gradients do not exist for variables ['convolution_layer/bias:0'] when minimizing the loss.
1786/1786 [==============================] - ETA: 0s - loss: 0.9755 - coeff_determination: 0.0360 - spearman_fn: 0.2879self.run value is 4
1786/1786 [==============================] - 547s 305ms/step - loss: 0.9755 - coeff_determination: 0.0360 - spearman_fn: 0.2879 - val_loss: 0.9627 - val_coeff_determination: 0.0183 - val_spearman_fn: 0.3484
Epoch 2/2
1786/1786 [==============================] - 534s 299ms/step - loss: 0.9341 - coeff_determination: 0.0822 - spearman_fn: 0.3821 - val_loss: 0.9561 - val_coeff_determination: 0.0246 - val_spearman_fn: 0.3474
self.run value is 5
Test spearman averages are: [0.29964785 0.12058796 0.18712451 0.18904677]
Test Mean spearman is 0.18190417887610844
Validation spearman averages are: [0.30672115 0.13403166 0.22160025 0.18567283]
Validation Mean spearman is 0.1950412965286522
--- 1104.547336101532 seconds ---
