Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
forward (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
reverse (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
convolution_layer (ConvolutionL (None, 134, 512)     25088       forward[0][0]
                                                                 reverse[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 268, 512)     0           convolution_layer[0][0]
                                                                 convolution_layer[1][0]
__________________________________________________________________________________________________
global_max_pooling1d (GlobalMax (None, 512)          0           concatenate[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 64)           32832       global_max_pooling1d[0][0]
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 1)            65          dense[0][0]
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 1)            65          dense_1[0][0]
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1)            65          dense_2[0][0]
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 1)            65          dense_3[0][0]
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1)            65          dense_4[0][0]
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 1)            65          dense_5[0][0]
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 1)            65          dense_6[0][0]
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 1)            65          dense_7[0][0]
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1)            65          dense_8[0][0]
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1)            65          dense_9[0][0]
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 1)            65          dense_10[0][0]
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 1)            65          dense_11[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 12)           0           dense_12[0][0]
                                                                 dense_13[0][0]
                                                                 dense_14[0][0]
                                                                 dense_15[0][0]
                                                                 dense_16[0][0]
                                                                 dense_17[0][0]
                                                                 dense_18[0][0]
                                                                 dense_19[0][0]
                                                                 dense_20[0][0]
                                                                 dense_21[0][0]
                                                                 dense_22[0][0]
                                                                 dense_23[0][0]
==================================================================================================
Total params: 419,852
Trainable params: 419,852
Non-trainable params: 0
