Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
forward (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
reverse (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
convolution_layer_1 (Convolutio (None, 134, 512)     25088       forward[0][0]
                                                                 reverse[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 268, 512)     0           convolution_layer_1[0][0]
                                                                 convolution_layer_1[1][0]
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 268, 512)     0           concatenate_2[0][0]
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 67, 512)      0           re_lu[0][0]
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 61, 200)      717000      max_pooling1d[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 15, 200)      0           conv1d[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 512)          0           re_lu[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 3000)         0           max_pooling1d_1[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 3512)         0           global_max_pooling1d_1[0][0]
                                                                 flatten[0][0]
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 12)           42156       concatenate_3[0][0]
==================================================================================================
Total params: 784,244
Trainable params: 784,244
Non-trainable params: 0
