Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
forward (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
reverse (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
convolution_layer (ConvolutionL (None, 134, 512)     25088       forward[0][0]
                                                                 reverse[0][0]
__________________________________________________________________________________________________
tf.math.maximum (TFOpLambda)    (None, 134, 512)     0           convolution_layer[0][0]
                                                                 convolution_layer[1][0]
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 134, 512)     0           tf.math.maximum[0][0]
__________________________________________________________________________________________________
global_average_pooling1d (Globa (None, 512)          0           re_lu[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 12)           6156        global_average_pooling1d[0][0]
==================================================================================================
Total params: 31,244
Trainable params: 31,244
Non-trainable params: 0
