Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
forward (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
reverse (InputLayer)            [(None, 145, 4)]     0
__________________________________________________________________________________________________
convolution_layer_2 (Convolutio (None, 134, 512)     25088       forward[0][0]
                                                                 reverse[0][0]
__________________________________________________________________________________________________
tf.math.maximum (TFOpLambda)    (None, 134, 512)     0           convolution_layer_2[0][0]
                                                                 convolution_layer_2[1][0]
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 134, 512)     0           tf.math.maximum[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 11, 512)      0           re_lu_1[0][0]
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 11, 32)       16416       max_pooling1d_2[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_2 (GlobalM (None, 512)          0           re_lu_1[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 352)          0           conv1d_1[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 864)          0           global_max_pooling1d_2[0][0]
                                                                 flatten_1[0][0]
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 12)           10380       concatenate_4[0][0]
==================================================================================================
Total params: 51,884
Trainable params: 51,884
Non-trainable params: 0
